cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF40xN.svd
        <!-- REGISTER "TTCR1" -->
        <register>
          <name>TTCR1</name>
          <description>PPG Start Trigger Control Register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xF000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRG7O" -->
            <field>
              <name>TRG7O</name>
              <description>PPG7 trigger stop bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG5O" -->
            <field>
              <name>TRG5O</name>
              <description>PPG5 trigger stop bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG3O" -->
            <field>
              <name>TRG3O</name>
              <description>PPG3 trigger stop bit</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRG1O" -->
            <field>
              <name>TRG1O</name>
              <description>PPG1 trigger stop bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1" -->
            <field>
              <name>CS1</name>
              <description>8-bit UP counter clock select bits for comparison</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MONI1" -->
            <field>
              <name>MONI1</name>
              <description>8-bit UP counter operation state monitor bit for comparison</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STR1" -->
            <field>
              <name>STR1</name>
              <description>8-bit UP counter operation enable bit for comparison</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "COMP0" -->
        <register>
          <name>COMP0</name>
          <description>PPG Compare Register 0</description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
        </register>
        <!-- REGISTER "COMP2" -->
        <register>
          <name>COMP2</name>
          <description>PPG Compare Register 2</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "COMP4" -->
        <register derivedFrom="COMP0">
          <name>COMP4</name>
          <description>PPG Compare Register 4</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "COMP6" -->
        <register derivedFrom="COMP2">
          <name>COMP6</name>
          <description>PPG Compare Register 6</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "COMP1" -->
        <register derivedFrom="COMP0">
          <name>COMP1</name>
          <description>PPG Compare Register 1</description>
          <addressOffset>0x28</addressOffset>
        </register>
        <!-- REGISTER "COMP3" -->
        <register derivedFrom="COMP2">
          <name>COMP3</name>
          <description>PPG Compare Register 3</description>
          <addressOffset>0x2C</addressOffset>
        </register>
        <!-- REGISTER "COMP5" -->
        <register derivedFrom="COMP0">
          <name>COMP5</name>
          <description>PPG Compare Register 5</description>
          <addressOffset>0x30</addressOffset>
        </register>
        <!-- REGISTER "COMP7" -->
        <register derivedFrom="COMP2">
          <name>COMP7</name>
          <description>PPG Compare Register 7</description>
          <addressOffset>0x34</addressOffset>
        </register>
        <!-- REGISTER "TRG" -->
        <register>
          <name>TRG</name>
          <description>PPG Start Register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEN15" -->
            <field>
              <name>PEN15</name>
              <description>PPG15 Start Trigger bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN14" -->
            <field>
              <name>PEN14</name>
              <description>PPG14 Start Trigger bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN13" -->
            <field>
              <name>PEN13</name>
              <description>PPG13 Start Trigger bit</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN12" -->
            <field>
              <name>PEN12</name>
              <description>PPG12 Start Trigger bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN11" -->
            <field>
              <name>PEN11</name>
              <description>PPG11 Start Trigger bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN10" -->
            <field>
              <name>PEN10</name>
              <description>PPG10 Start Trigger bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN09" -->
            <field>
              <name>PEN09</name>
              <description>PPG9 Start Trigger bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN08" -->
            <field>
              <name>PEN08</name>
              <description>PPG8 Start Trigger bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN07" -->
            <field>
              <name>PEN07</name>
              <description>PPG7 Start Trigger bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN06" -->
            <field>
              <name>PEN06</name>
              <description>PPG6 Start Trigger bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN05" -->
            <field>
              <name>PEN05</name>
              <description>PPG5 Start Trigger bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN04" -->
            <field>
              <name>PEN04</name>
              <description>PPG4 Start Trigger bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN03" -->
            <field>
              <name>PEN03</name>
              <description>PPG3 Start Trigger bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN02" -->
            <field>
              <name>PEN02</name>
              <description>PPG2 Start Trigger bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN01" -->
            <field>
              <name>PEN01</name>
              <description>PPG1 Start Trigger bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN00" -->
            <field>
              <name>PEN00</name>
              <description>PPG0 Start Trigger bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REVC" -->
        <register>
          <name>REVC</name>
          <description>Output Reverse Register 0</description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV15" -->
            <field>
              <name>REV15</name>
              <description>PPG15 Output Reverse Enable bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV14" -->
            <field>
              <name>REV14</name>
              <description>PPG14 Output Reverse Enable bit</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV13" -->
            <field>
              <name>REV13</name>
              <description>PPG13 Output Reverse Enable bit</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV12" -->
            <field>
              <name>REV12</name>
              <description>PPG12 Output Reverse Enable bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV11" -->
            <field>
              <name>REV11</name>
              <description>PPG11 Output Reverse Enable bit</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV10" -->
            <field>
              <name>REV10</name>
              <description>PPG10 Output Reverse Enable bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV09" -->
            <field>
              <name>REV09</name>
              <description>PPG9 Output Reverse Enable bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV08" -->
            <field>
              <name>REV08</name>
              <description>PPG8 Output Reverse Enable bit</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV07" -->
            <field>
              <name>REV07</name>
              <description>PPG7 Output Reverse Enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV06" -->
            <field>
              <name>REV06</name>
              <description>PPG6 Output Reverse Enable bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV05" -->
            <field>
              <name>REV05</name>
              <description>PPG5 Output Reverse Enable bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV04" -->
            <field>
              <name>REV04</name>
              <description>PPG4 Output Reverse Enable bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV03" -->
            <field>
              <name>REV03</name>
              <description>PPG3 Output Reverse Enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV02" -->
            <field>
              <name>REV02</name>
              <description>PPG2 Output Reverse Enable bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV01" -->
            <field>
              <name>REV01</name>
              <description>PPG1 Output Reverse Enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV00" -->
            <field>
              <name>REV00</name>
              <description>PPG0 Output Reverse Enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC0" -->
        <register>
          <name>PPGC0</name>
          <description>PPG Operation Mode Control Register 0</description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description>PPG Interrupt Enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description>PPG Counter Underflow bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description>Interrupt Mode Select bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description>PPG DOWN Counter Operation Clock Select bits</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>PPG Operation Mode Set bits</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTRG" -->
            <field>
              <name>TTRG</name>
              <description>PPG start trigger select bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC1" -->
        <register derivedFrom="PPGC0">
          <name>PPGC1</name>
          <description>PPG Operation Mode Control Register 1</description>
          <addressOffset>0x200</addressOffset>
        </register>
